# -*- coding: utf-8 -*-
"""
@Name:        ex4.py
@Describe:    XXX
@Time:        2025/01/14 22:12:21
@Author:      Ray
@Version:     1.0
"""
import statistics

text = """
1、反转列表中的元素顺序,numbers = [5,2,9,1,7,6]
2、给定一个列表,筛选出列表中大于等于5的元素,并存储在一个新的列表中。l=[23, 4, 5,66, 76,12,88,23,65],保留所有的偶数
3、列表元素求和:编写一个程序,计算给定列表中所有元素的和,但要跳过列表中的负数,numbers = [1,2,-3,4,-5,6,7,-8,9]
4、编写一个程序,将列表中的所有字符串元素反转。
5、从一个列表中移除重复的元素,numbers = [1,2,3,2,4,3,5, 6,5]编写一个程序,找到给定列表中的最大值和最小值。
6、将二维列表中所有元素放在一个新列表中,numbers = [I1,2,3],14,5,6」
[7.8,9J1
7、编写一个程序,计算给定列表中所有正数元素的平均值。
8、扑克游戏连续发牌,5个人,每人三张！
9、当给定一个列表,找出列表中任意两个元素之间的最大差值和最小差值。
10、编写一个程序,找到给定列表中的所有大于平均值的元素并计算它们的总和。
11、给定一个嵌套列表,表示学生的成绩数据,数据结构如下:scores =[[85,90,78],[76,82,88],[90,92,861,168,72,80],[92,88,90]]
12、请编写程序完成以下操作:1、计算每个学生的平均分。2、计算每科的平均分。引导用户输入页数(每页获取3条数据),实现对作品列表的切片获取,并进行格式化打
"""


def main():
    numbers = [5, 9, 1, 7, 6]
    print(numbers[::-1])

    l1 = [23, 4, 5, 66, 76, 12, 88, 23, 65]
    l2 = [i for i in l1 if i % 2 == 0]
    print(l2)

    l3 = [1, 2, -3, 4, -5, 6, 7, -8, 9]
    l4 = [i for i in l3 if i > 0]
    print(l4)

    l5 = ["want", "to", "fly", "ok"]
    l6 = [s[::-1] for s in l5]
    print(l6)

    nested_data = [[85, 90, 78], [76, 82, 88], [
        90, 92, 861, 168, 72, 80], [92, 88, 90]]
    flattened_data = ["{:.1f}".format(statistics.mean(sublist))
                      for sublist in nested_data]
    print(flattened_data)

    flat_list = [i for sublist in nested_data for i in sublist]
    print(flat_list)


if __name__ == '__main__':
    main()
